Pandas
- 구조화된 데이터의 처리를 지원하는 python 라이브러리

In [24]:
import pandas as pd # 라이브러리 호출 
import numpy as np

In [21]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'

df_data = pd.read_csv(data_url, sep='\s+',header=None)
print(df_data)

          0     1      2   3      4      5     6       7   8      9     10  \
0    0.00632  18.0   2.31   0  0.538  6.575  65.2  4.0900   1  296.0  15.3
1    0.02731   0.0   7.07   0  0.469  6.421  78.9  4.9671   2  242.0  17.8
2    0.02729   0.0   7.07   0  0.469  7.185  61.1  4.9671   2  242.0  17.8
3    0.03237   0.0   2.18   0  0.458  6.998  45.8  6.0622   3  222.0  18.7
4    0.06905   0.0   2.18   0  0.458  7.147  54.2  6.0622   3  222.0  18.7
..       ...   ...    ...  ..    ...    ...   ...     ...  ..    ...   ...
501  0.06263   0.0  11.93   0  0.573  6.593  69.1  2.4786   1  273.0  21.0
502  0.04527   0.0  11.93   0  0.573  6.120  76.7  2.2875   1  273.0  21.0
503  0.06076   0.0  11.93   0  0.573  6.976  91.0  2.1675   1  273.0  21.0
504  0.10959   0.0  11.93   0  0.573  6.794  89.3  2.3889   1  273.0  21.0
505  0.04741   0.0  11.93   0  0.573  6.030  80.8  2.5050   1  273.0  21.0

         11    12    13
0    396.90  4.98  24.0
1    396.90  9.14  21.6
2    392.83  4.03  34.7
3    394.63  2.94  33.4
4    396.90  5.33  36.2
..      ...   ...   ...
501  391.99  9.67  22.4
502  396.90  9.08  20.6
503  396.90  5.64  23.9
504  393.45  6.48  22.0
505  396.90  7.88  11.9

[506 rows x 14 columns]

In [19]:
df_data.loc[1]

0       0.02731
1       0.00000
2       7.07000
3       0.00000
4       0.46900
5       6.42100
6      78.90000
7       4.96710
8       2.00000
9     242.00000
10     17.80000
11    396.90000
12      9.14000
13     21.60000
Name: 1, dtype: float64

In [22]:
df_data.iloc[1,:]

0       0.02731
1       0.00000
2       7.07000
3       0.00000
4       0.46900
5       6.42100
6      78.90000
7       4.96710
8       2.00000
9     242.00000
10     17.80000
11    396.90000
12      9.14000
13     21.60000
Name: 1, dtype: float64

In [35]:
s = pd.Series(np.nan, index=[49,48,47,46,45,1,2,3,4,5])
print(f'iloc : {s.iloc[:3]}')
print(f'loc : {s.loc[:3]}')

iloc : 49   NaN
48   NaN
47   NaN
dtype: float64
loc : 49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

merge : 데이터 병합 
drop(index number) : 데이터 제거

In [52]:
from pandas import Series,DataFrame
s1 = Series(range(1,6), index=list("abcde"))
print(s1)
s2 = Series(range(5,11), index=list("abcedf"))
print(s2)

a    1
b    2
c    3
d    4
e    5
dtype: int64
a     5
b     6
c     7
e     8
d     9
f    10
dtype: int64

In [ ]:
#  Seires operation

In [49]:
s1.add(s2)

a     6.0
b     8.0
c    10.0
d    13.0
e    13.0
f     NaN
dtype: float64

In [50]:
s1 + s2

a     6.0
b     8.0
c    10.0
d    13.0
e    13.0
f     NaN
dtype: float64

In [ ]:
# Dataframe operation

In [56]:
df1 = DataFrame(np.arange(9).reshape(3,3),columns=list("abc"))
print(df1)
df2 = DataFrame(np.arange(16).reshape(4,4),columns=list("abcd"))
print(df2)

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8
    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [57]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [58]:
df1.add(df2,fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [ ]:
# Seires + Dataframe

In [60]:
df = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
print(df)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [61]:
s = Series(np.arange(10,14), index=list("abcd"))
print(s)

a    10
b    11
c    12
d    13
dtype: int32

In [62]:
df + s # column을 기준으로 broadcasting 발생

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [63]:
df.add(s)

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [ ]:
# map for seires

In [64]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [65]:
s1.map(lambda x:x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

df.describe() : 통계적 값들을 확인 할 수 있다.

Groupby
- SQL groupby 명령어와 같음
- split -> apply -> combine
- 과정을 거쳐 연산한다.

In [83]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [84]:
df.groupby(['Team','Year'])['Points'].sum()

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
kings   2015    812
Name: Points, dtype: int64

In [85]:
grouped = df.groupby("Team")

for name, group in grouped: 
    print(name)
    print(group)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804
kings
    Team  Rank  Year  Points
5  kings     4  2015     812

In [ ]:
# Groupby - aggregation

In [86]:
grouped.agg(sum)

        Rank  Year  Points
Team
Devils     5  4029    1536
Kings      5  6047    2285
Riders     7  8062    3049
Royals     5  4029    1505
kings      4  2015     812

In [87]:
grouped.agg(np.mean)

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000
kings   4.000000  2015.000000  812.000000

In [100]:
grouped['Points'].agg([np.sum,np.mean,np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

Merge : 두 개의 데이터를 하나로 합침 
code_ex) pd.merge(df_a,df_b, on='column_name') # column 명이 같을 경우 
code_ex2) pd.merge(df_a, df_b, left_on='column_name', right_on='column_name')

Pickle persistence
- 가장 일반적인 python 파일 persistence
- to_pickle, read_pickle 함수 사용 

code_ex) df.to_pickle("./data/df.pickle")
code_ex) df_pickle = pd.read_pickle("./data/df.pickle")